// Detects GreenPlasma by monitoring for suspicious ALPC port activity and the creation of unexpected memory sections by ctfmon.exe.
// Subject to change as POC become available.
// https://github.com/Nightmare-Eclipse/GreenPlasma

//UAC Trigger Anomaly
DeviceProcessEvents
| where ActionType == "ProcessCreated"
| where FileName =~ "consent.exe" 
| where ProcessCommandLine contains "conhost.exe" 
| project Timestamp, DeviceName, InitiatingProcessAccountName, ProcessCommandLine


//DisableLockWorkstation Registry Tampering
DeviceRegistryEvents
| where RegistryKey contains @"Policies\System\DisableLockWorkstation"
| where RegistryValueData == "1"
| project Timestamp, DeviceName, InitiatingProcessFileName, RegistryKey
